sdaiIsRecordingOn(Sdai_instS*)
\details
Retrieves the current recording flag value.
The recording flag determines whether the recording is on or off.
\returns true if the recording is on; otherwise, the function returns false.